#*******************************************************
#*******《应用多元统计分析》（第五版）R代码 ********
#****************** 王学民   2021.2 ********************
#从https://anyshare.sufe.edu.cn/#/link/B9F2F217DF9A179950462AF6B590145F下载《应用多元统计分析》（第五版）配书资料，下载的资料中有一个“《应用多元统计分析》（第五版）文本数据（以逗号为间隔）”的文件夹#
#假定数据存储目录为“C:/mvdata/”#
#*******************************************************


###第二章###

##例2.2.3和例2.2.5##
A<-matrix(c(2, 0, 1, -1, 1, 3, 4, -1, -2), nrow=3) #创建一个3阶方阵
Ex<-c(5, -2, 7)
Vx<-matrix(c(4, 1, 2, 1, 9, -3, 2, -3, 25), nrow=3)
D<-sqrt(diag(diag(Vx))) #sqrt( )是平方根函数
D
Ey<-A%*%Ex
Ey
Vy<-A%*%Vx%*%t(A)
Vy
Rx<-solve(D)%*%Vx%*%solve(D)
Rx

##习题2.9##
A<-matrix(c(2, 1, 0, 3, -2, 1, 1, 5, -1), nrow=3)
Vx<-matrix(c(9, 1, -2, 1, 20, 3, -2, 3, 12), nrow=3)
D<-sqrt(diag(diag(Vx)))
Vy<-A%*%Vx%*%t(A)
Vy

##习题2.12##
V<-matrix(c(16, -4, 3, -4, 4, -2, 3, -2, 9), nrow=3)
D<-sqrt(diag(diag(V)))
D
R<-solve(D)%*%V%*%solve(D)
R
