data exec62(type=distance);
    array x(14) x1-x14;
    input  v $12. x1-x14;
    do i=1 to 14;
      x(i)=1-x(i);
    end;
    drop i;
    cards;
上体长(x1)   1.000  .     .     .     .     .     .     .     .     .     .     .     .     .
手臂长(x2)    .366 1.000  .     .     .     .     .     .     .     .     .     .     .     .
胸围(x3)      .242  .233 1.000  .     .     .     .     .     .     .     .     .     .     .
颈围(x4)      .280  .194  .590 1.000  .     .     .     .     .     .     .     .     .     .
总肩宽(x5)    .360  .324  .476  .435 1.000  .     .     .     .     .     .     .     .     .
前胸宽(x6)    .282  .263  .483  .470  .452 1.000  .     .     .     .     .     .     .     .
后背宽(x7)    .245  .265  .540  .478  .535  .633 1.000  .     .     .     .     .     .     .
前腰节高(x8)  .448  .345  .452  .404  .431  .322  .266 1.000  .     .     .     .     .     .
后腰节高(x9)  .486  .367  .365  .357  .429  .283  .287  .820 1.000  .     .     .     .     .
总体高(x10)   .648  .662  .216  .316  .429  .283  .263  .527  .547 1.000  .     .     .     .
身高(x11)     .679  .681  .243  .313  .430  .302  .294  .520  .558  .957 1.000  .     .     .
下体长(x12)   .486  .636  .174  .243  .375  .290  .255  .403  .417  .857  .852 1.000  .     .
腰围(x13)     .133  .153  .732  .477  .339  .392  .446  .266  .241  .054  .099  .055 1.000  .
臀围(x14)     .376  .252  .676  .581  .441  .447  .440  .424  .372  .363  .376  .321  .627 1.000
;
/*在SAS9.3及以上版本中，下面的tree过程都可以省略*/
proc print data=exec62;
proc cluster data=exec62 method=sin;
   	var x1-x14;
   	id  v;
proc tree horizontal;
   	id  v;
proc cluster data=exec62 method=com;
   	var x1-x14;
   	id  v;
proc tree horizontal;
   	id  v;
proc cluster data=exec62 method=ave;
   	var x1-x14;
   	id  v;
proc tree horizontal;
   	id  v;
run;
