proc discrim data=sasuser.exec47  outstat=exec47out;
	class g;
    var x1-x5;
/*下面程序中的样本均值x,y和联合协差阵Sp均可从上述程序产生的数据集exec47out中获得*/
proc iml;
	x={20.8,24.4,22.6,19.2,14};
	y={24.8,21.8,24.6,23.2,20.4};
	Sp={72.7 33.025 41.65 18.675 22.3,
	    33.025 21.25 21.3 12.725 11.925,
	    41.65 21.3 41.3 16.35 9.85,
		18.675 12.725 16.35 11.45 10.2,
 	    22.3 11.925 9.85 10.2 21.65};
	C={1 -1  0  0  0,
	   0  1 -1  0  0,
	   0  0  1 -1  0,
	   0  0  0  1 -1};
	T2=5*5/(5+5)*t(x-y)*t(C)*inv(C*Sp*t(C))*C*(x-y);
	F=(5+5-4-1)/4/(5+5-2)*T2;
print T2 F;
